print("hello world")
print(7 + 5)
print(4 - 4)
print(0 - 2)
print(2 + 3)
print(3 + 2 - 8 * 7)

#У програмі визначте три наступні змінні:
#a = 7
#b = -4
#c = 3
#Виведіть у консоль їх значення, використовуючи одну функцію print (між значеннями змінних має стояти один пробіл).

a = 7
b = -4
c = 3
print(a, b, c)

#У програмі визначте три наступні змінні:
#a = 7
#b = -4
#c = 3
#Виведіть у консоль їх значення у стовпчик (кожне нове значення відображається з нового рядка), використовуючи одну функцію print.

a = 7
b = -4
c = 3
print(a, b, c, sep="\n")

#У програмі визначте два наступні рядки:
#s1 = "Hello"
#s2 = "Mike"
#За допомогою двох функцій print (кожен відображає відповідний рядок) відобразіть рядки в консолі так, щоб вони йшли один за одним через пропуск.

s1 = "Hello"
s2 = "Mike"
print(s1, end=" ")
print(s2, end=" ")

#Допишіть програму, в якій вводяться два слова (змінні s1 і s2) в один рядок через пробіл, і відображаються в консолі у форматі:
#Слово 1: s1 | Слово 2: s2

s1, s2 = map(str.strip, input().split())
print(f"Word 1: {s1} | Word 2: {s2}")

#Напишіть програму, в якій вводяться два цілі додатні числа і в консоль виводиться результат зведення першого числа до другого.

a, b = map(int, input().split())
print(a ** b)

#Напишіть програму, яка приймає на вхід два речові(float) числа в один рядок через пробіл і виводить на екран їхню суму.

a, b = map(float, input().split())
print(a + b)

#У магазині продається X синіх ручок, Y зелених, чорних вдвічі більше, ніж синіх, а червоних у чотири рази більше зелених. Напишіть програму, в якій вводяться цілі значення X, Y в один рядок через пропуск за допомогою команди:
#X, Y = map(int, input().split())
#і виводиться на екран загальна кількість ручок як цілого числа.

X, Y = map(int, input().split())
print(X + Y + 2 * X + 4 * Y)

#Вводяться довжина та ширина прямокутника (кожне речове(float) значення з нового рядка). Необхідно обчислити його периметр (суму довжин сторін) та результат вивести на екран.

a = float(input())
b = float(input())
print(2 * (a + b))

#Напишіть програму виведення змінної math.pi з точністю до тисячних (три знаки після коми).

import math
print(round(math.pi, 3))

#Скласти програму виведення на екран речового числа(float), що вводиться з клавіатури. Число, що виводиться, має передувати повідомлення "Ви ввели число" (без лапок).

a = float(input())
print(f"Ви ввели число {a}")