#Обчислення модуля введеного з клавіатури числа - змінна d і виведення значення до консолі за допомогою функції print.

d = int(input())
print(abs(d))

#Отримати мінімальне значеня із п'яти введених цілих чисел.

d1, d2, d3, d4, d5 = map(int, input().split())
print(min(d1, d2, d3, d4, d5))

#Отримати максимальне значеня із п'яти введених цілих чисел.

d1, d2, d3, d4, d5 = map(int, input().split())
print(max(d1, d2, d3, d4, d5))

#Обчислити гіпотенузу знаючи сторони a та b. Округліть результат з точністю до сотих.
a, b = map(int, input().split())
c = (a * a + b ** 2) ** 0.5
print(round(c, 2))

#Розрахувати значення за заданною формулою.

import math
n, k = map(int, input().split())
a = math.factorial(n) / (math.factorial(k) * math.factorial(n-k))
print(round(a))

#У літній табір потрібно відвести n дітей та m вожатих за допомогою автобусів. Максимальна місткість кожного автобуса – 20 осіб. Розрахувати мінімальну кількості автобусів, необхідних для перевезення дітей разом з вожатими. Результат виведіть у консоль у вигляді цілого числа.

import math
n, m = map(int, input().split())
print(math.ceil((n + m) / 20))

#Гелева ручка коштує x карбованців. Сьогодні магазин надає знижку 10% на кожну куплену ручку. Яку кількість таких ручок можна буде купити на 500 карбованців? Результат виведіть у консоль у вигляді цілого числа.

import math
x = int(input())
print(math.floor(500 / (x * 0.9)))