#Форматування строк і F-строки

a = 18
n = "Mike"
s1 = "My name is " + n + ", i am " + str(a) + " year old."
s2 = "My name is {fio}, i am {old} year old.".format(fio=n, old=a)
print(s1, s2, sep="\n")
print(f"My name is {n.upper()}, i am {2 * a} year old.")

#Задачі
#Вводяться: ім'я, прізвище та вік (ціле позитивне число) кожне значення з нового рядка. Використовуючи метод рядка format, через індекси змінних необхідно сформувати рядок за шаблоном:
#"Шановний <ім'я> <прізвище>! Вітаємо Вас з <вік-літтям!"
#Результат вивести на екран (без лапок).

print(f"Уважаемый {input()} {input()}! Поздравляем Вас с {input()}-летием!")

# Вводяться: габарити виробу (цілі числа): ширина, глибина, висота - в одну сходинку через пропуск. За допомогою методу format, використовуючи ключі як імена змінних, сформувати рядок: "Габарити: <ширина> x <глибина> x <висота>". Результат вивести на екран.

a, b, c = input().split()
print("Габариты: {0} x {1} x {2}".format(a, b, c))

#Вводяться: два цілих числа в один рядок через пропуск. За допомогою F-рядка відобразити їх за зростанням в один рядок через пропуск. Результат вивести на екран.

a, b = input().split()
print(f"{min(a, b)} {max(a, b)}")

#Вводиться адреса (кожне значення нового рядка) у форматі: місто, вулиця, номер будинку (ціле число), номер квартири (ціле число). Сформувати рядок за шаблоном: "м. <місто>, вул. <вулиця>, буд. <номер будинку>, кв. <номер квартири>", використовуючи F-рядок. Результат вивести на екран.

print(f"г. {input()}, ул. {input()}, д. {input()}, кв. {input()}")

#Вводяться (кожне з нового рядка): курс долара (речове значення) та кількість рублів (ціле число) для обміну рублів на долари. Обчислити цілу кількість одержуваних доларів (з відкиданням дробової частини) і сформувати рядок, використовуючи F-рядок:
#"Ви можете отримати <доларів> $ за <число грн> грн за курсом <курс долара>".

a, b = float(input()), float(input())
print(f"Вb можете отримати {int(b / a)}$ за {int(b)} грн по курсу {a}")