#Індекси і зрізи
#Напишіть програму введення рядка та відображення на екрані першого і останнього символу у вигляді одного рядка.

a = input()
print(f"{a[0]+a[-1]}")

#Напишіть програму відображення перших чотирьох символів із введеного рядка. Вважатимемо, що рядок гарантовано довжиною не менше чотирьох символів.

a = input()
print(a[:4])

#Напишіть програму відображення останніх трьох символів із введеного рядка. Вважатимемо, що рядок гарантовано довжиною не менше трьох символів.

a = input()
print(a[-3:])

#Напишіть програму відображення всіх символів з непарними індексами із введеного рядка.

print(input()[1::2])

#Вводяться два рядки (кожний з нового рядка). З першого рядка виділити всі символи з парними індексами, з другого - з непарними. Об'єднати рядки через пробіл і вивести на екран.

print(f"{input()[::2]} {input()[1::2]}")

#З введеного рядка відобразити перші п'ять символів у зворотному порядку. Введений рядок має мінімум п'ять символів.

a = input()
b = len(a)
print(a[4 - b::-1])

#Вводится два слова (через проміжок в одній строці). Довжина першого слова менше ніж другого. Необхідно обрізати друге слово до довжини першого і відобразити обрізане слово на екрані.

a, b = input().split()
print(b[:len(a)])

#Вводяться два слова (через проміжок в одному рядку). Довжина другого слова менша за перше. З цих слів виділити символи з непарними індексами з обрізанням першого слова до довжини другого. Порівняти отримані рядки між собою на рівність та результат (True або False) вивести на екран. Завдання виконувати без використання умовного оператора.

a, b = input().split()
print(a[1:len(b):2] == b[1::2])