t = "\tМіша хоче \\сісти\\ гг\bрушу\nвкусну грушу\n"
t1 = "C:\\Users\\Public\\Videos\n"
t2 = r"C:\\Users\\Public\\Videos\n"
print(t, t1, t2)

#Задачки
#Необхідно задати строку таким чином, щоб вона містилася: Тема заняття "спецсимволи". І відобразити її на екрані (кавички у слові спецсимволи також повинні бути відображені).

print("Тема занятия \"спецсимволы\"")

#Вводиться два слова в один рядок через пропуск. Поставте між цими словами символ зворотного сліша (замість пропуску). Відобразіть результуючий рядок на екрані.

print(input().replace(" ","\\"))

# Вводиться рядок зі словами, розділеними пробілом. Необхідно перший пропуск замінити на одинарну лапку, а всі інші - на подвійні. Результуючий рядок відображається на екрані.

print(input().replace(" ", "\'", 1).replace(" ", "\""))

#Використовуючи raw-рядки, задайте рядок, що містить цей шлях до файлу: C:\WINDOWS\System32\drivers\etc\hosts. Результат відображається на екрані.

print(r"C:\WINDOWS\System32\drivers\etc\hosts")

#Вводиться слово. Необхідно сформувати новий рядок, де введене слово буде укладено у подвійні лапки. Результат виведіть на екран.

a = input()
print(f"\"{a}\"")