#Дії зі строками
# Напишіть програму введення двох рядків (кожен вводиться з нового рядка) та їх об'єднання в один рядок через пробіл. Результат виведіть на екран.

a = input()
b = input()
print(a + " " + b)

#Напишіть програму введення двох слів через проміжок. Сформуйте нову строку, дублюючи перше слово два рази, а друге - три рази (всі слова в результуючій строці повинні ідти через пробіл). Результат виведіть на екран.
#Програму слід реалізувати без використання F-строк, а із застосуванням оператора дублювання рядка.

a, b = map(str, input().split())
print((a + " ") * 2 + (b + " ") * 3)

#Виконується розрахунок двох цілочисленних значень у змінних a і b (вводяться в одну строчку через пробіл). Необхідно сформувати строку типу: "Змінна a = <значення>, змінна b = <значення>", використовуючи оператор конкатенації (з'єднання) строки. Результат виведіть на екран.
#PS F-строки в програмі не використовувати.

a, b = input().split()
print("Змінна a = " + a + ", Змінна b = " + b)

#Написати програму введення рядка та формування нового рядка виду: "Рядок: <введений рядок>. Довжина: <довжина рядка>". Результат сформованого рядка вивести на екран.
#PS У програмі F-рядки не використовувати.

a = input()
print("Строка: " + a + ". Довжина: ", len(a))

#Написати програму введення двох слів (через пропуск в один рядок). Визначити булеви значення для оператора in перевірки входження першого слова до другого. А також для операторів ==, >, <. Всі булеві значення об'єднати в один рядок через пропуск і вивести на екран.

a, b = input().split()
print(a in b, a == b, a > b, a < b)

#З клавіатури вводяться дві літери (в один рядок через пропуск). Вивести на екран наступний рядок:
#"Коди: <літера1> = <код букви1>, <літера2> = <код букви2>"

a, b = input().split()
print(f"Код: {a} = {ord(a)}, {b} = {ord(b)}")