#Дії зі строками
#Варіанти запису
t1 = "One"
t2 = "Two"
t3 = 'Three'
t4 = '''Four'''

a = 3

print(t1, t2, t3, t4) #Вивід строки
print(t1 + t2, t1 + "-" + t2 + "-" + t3, t1 + " < a - " + str(a > 1),
      str(a) * a * a,
      sep = "\n==============\n") #Різні дії зі строками
      
print(len(t1), len(t2))  #Вивід довжини строки
print(f"T в {t1} {t2} {t3} {t4}") #Вивід через f строкe
print("T" in t1, "T" in t2, "T" in t3, "T" in t4)
print(t1,">", t2)
print(t1 > t2)
t5 = "У лісі\nдуже темно" #перенос строки \n
t6 = '''У лісі живе
страшний ведмідь''' #перенос строки '''

print(t5, t6)

#Задачки
a, b = map(str, input("Введіть слова").split())
print(f"Перша літера першого слова {a[0]}, остання буква другого слова {b[-1]}, пять центраьних символів  - {a[-3:]} {b[:3]}")

