#Строки і їх методи
#Варіанти запису

s = "slonopotam"

a = s.upper() #Верхній регістр
b = a.lower() #Нижній регістр

c = a + b + s + a + "12132"

d = c.count("ono", 4, -6) #count() Рахує кількість "оно" в зрізі 4 ; -6

e, f = c.find("AM", 43), c.rfind("AM") #.find() Виводить индекс "АМ" у строці
g = c.index("AM")

h = c.replace("o", " ", 4) #replace() Замінює "o" на " " 4 рази

i = c.isalpha() #True/False перевірка чи є лише літералом
j = c.isdigit() #True/False перевірка чи є лише цифрою

k, l = s.rjust(15, "_"), s.ljust(15, "_")

m = h.split(" ")

n = c.upper().replace("O", "").replace("N", "").split("M")

o = "-".join(n) #Поєднює всі елементи п в строку через -

print(a, b, c, d, e, f, g, h, i, j, k, l, m, n, o, sep="\n-------------------\n")

#Задачки
#Вводиться слово. Необхідно першу букву цього слова зробити головною, а інші - малими. Результат відображається на екрані.

a = input()
print(a[0].upper() + a[1:].lower())

#Вводиться рядок. Необхідно визначити кількість входжень дефісів (-) у цьому рядку. На екрані відобразити отримане число.

print(input().count("-"))

# Вводиться рядок. За допомогою методу String.find знайдіть у цьому рядку індекс першого входження фрагмента "ra". Отримане число виведіть на екран.

print(input().find("ra"))

#Вводиться рядок. Замініть у цьому рядку всі подвійні дефіси (--) та потрійні (---) на одинарні (-). Подумайте, у якій послідовності слід виконувати ці заміни. Результати перетворення виведіть на екран.

print(input().replace("---", "--").replace("--", "-"))

#Вводяться три цілих позитивних числа (максимум тризначні) через пропуск в один рядок. Для двоцифрових і однозначних чисел потрібно додати ліворуч незначні нулі так, щоб усі числа містили по три цифри. Вивести на екран отримані числа у стовпчик.

a = input().split()
print(a[0].rjust(3, "0"), a[1].rjust(3, "0"), a[2].rjust(3, "0"), sep="\n")

#Вводиться рядок, що складається зі слів, розділених пропуском. Необхідно підрахувати число слів у цьому рядку та результат (число) відобразити на екрані.

print(input().count(" ") + 1)

#Вводиться рядок, що складається із назв міст, розділених пробілом. Необхідно перетворити цей рядок, щоб назви міст йшли через крапку з комою. Результат відображається на екрані.

print(input().replace(" ", ";"))

