line = [1, 3, 5, 1, 7]
img = [[1, 3, 5, 1, 7], [1, 3, 5, 1, 7], [1, 3, 5, 1, 7], [1, 3, 5, 1, 7], [1, 3, 5, 1, 7]]
print(*img)

img1 = [line[:], line[:], line[:], line[:], line[:]]

img1[1][3] = "False"

print(*img1)
print(*img1[1])
print(*img1[1][0:4])

img1[3] = [0] * 5
print(*img1)

a = [5.4, 6.7, 10.4]
a.append(list(map(int, input().split())))
lst = a[:]
print(lst)

t = [["Скажи-ка", "дядя", "ведь", "не", "даром"],
     ["Я", "Python", "выучил", "с", "каналом"],
     ["Балакирев", "что", "раздавал?"]]
     
c = t[0] + t[1] + t[2]
print(c.count(input()) > 0)

#Задачі
#В список:
#a = [5.4, 6.7, 10.4]
#додати в кінці вкладений список зі значеннями, введеними в програму (цілі числа вводяться в строчку через пробіл). Результативний список lst вивести на екран команди:

print(lst)
a = [5.4, 6.7, 10.4]
a.append(list(map(int, input().split())))
lst = a[:]
print(lst)

#Вводяться три рядки вірша (кожний з нового рядка). Зберегти його у вигляді вкладеного списку з розбивкою за рядками та словами (слова поділяються пробілом). Результуючий список lst вивести команду на екран: print(lst)

lst = [list(map(str, input().split( ))), list(map(str, input().split( ))), list(map(str, input().split( )))]
print(lst)

#Вводиться матриця чисел із трьох рядків. У кожному рядку числа поділяються пробілом. Необхідно вивести на екран останній стовпець цієї матриці у вигляді рядка із трьох чисел через пробіл.

t = [input().split(), input().split(), input().split()]
print(f"{t[0][3]} {t[1][3]} {t[2][3]}")

# Є вкладений список із трьох рядків:
#t = [["Скажи-ка", "дядя", "ведь", "не", "даром"],
#    ["Я", "Python", "выучил", "с", "каналом"],
#    ["Балакирев", "что", "раздавал?"]]
#Необхідно реалізувати перевірку на наявність цього списку введеного слова. Результат (True або False) вивести на екран. Вирішити завдання необхідно без застосування умовного оператора.

t = [["Скажи-ка", "дядя", "ведь", "не", "даром"],
     ["Я", "Python", "выучил", "с", "каналом"],
     ["Балакирев", "что", "раздавал?"]]
c = t[0] + t[1] + t[2]
print(c.count(input()) > 0)