m = [2, 4, 6, 22, 2]
s = (m[0] + m[1] + m[3] + m[3] + m[4]) / 6

print(m[1])
print(s)

m[0] = 6
s = (m[0] + m[1] + m[3] + m[3] + m[4]) / 6

print(m)
print(s)

m[2] = "Lesta"
m[4] = 3 > 2
m[0] = [4, 5, 22]

print(m)

a = list([True, True, False])
b = list("asdas324234")

print(a)
print(b)

l = len(b)
print(l)

t = [12.3, 84.3, 54.7, 54, 66.6, 999.9]
print(f"max = {max(t)}, min = {min(t)}.")

k = [2, 4, 6, 22, 2]
print(sum(k) / len(k))
ks = sorted(k)
kr = sorted(k, reverse=True)

print(k, ks, kr, sep="\n")

l =["slon", "kot", "lisica"]
print(l, sorted(l), sorted(l, reverse=True), sep="\n")
print(max(l), min(l))
print(k + l)
print(k * 2)

vj = "jaguar" in l
vk = "kot" in l
print(vj, vk)

del l[1]
print(l)

print(list(map(int, input().split())))
a = list(map(int, input().split()))
print(max(a), min(a), sum(a))

#Задачі
#Вводяться три цілих числа в один рядок через пропуск. Сформуйте список lst, який зберігає ці значення у порядку їх введення. Результат виведіть на екран, використовуючи команду:
#print(lst)

lst = input().split()
lst = [int(lst[0]), int(lst[1]), int(lst[2])]
print(lst)

#Вводяться назви міст в одну сходинку через пропуск. На основі цього рядка формується список за допомогою команди:
#cities = input().split()
#Необхідно перевірити, чи є у цьому списку місто "Москва". Вивести на екран True, якщо присутній і False - інакше. Вирішити це завдання слід без використання умовного оператора.

cities = input().split()
print("Москва" in cities)

#Вводятся названия городов в одну строчку через пробел. На основі цього рядка формується список за допомогою команди:
#cities = input().split()
#Необхідно вивести значення останнього елемента цього списку на екрані.

cities = input().split()
print(cities[-1])

#Вводяться оцінки студента (цілі числа від 2 до 5) в одну строчку через пробел. На основі введеної строки формується список команд:
#marks = list(map(int, input().split()))
#Необхідно вирахувати середній бал і вивести його на екран з точністю до десяти (один знак після запятой).

marks = list(map(int, input().split()))
print(round(sum(marks) / len(marks), 1))

#Вводиться інформація про книгу (кожне значення з нового рядка): назва, автор, число сторінок (ціле число), ціна (речове число). На основі цих даних формується список book з елементами в порядку їхнього введення. Потім, з цього списку необхідно видалити 3-й елемент (число сторінок), як автор записати "Пушкін" і ціну збільшити в 2 рази. Результат вивести на екран командою: print(book)

name = input()
author = input()
page = int(input())
cost = float(input())
book = [name, author, page, cost]
del book[2]
book[1] = "Пушкин"
book[2] = 2 * book[2]
print(book)

#Вводиться число нових передплатників каналу щодня в один рядок через пропуск. На основі введеного рядка необхідно сформувати список із цілих чисел. Потім, вивести на екран максимальне, мінімальне та сумарне значення цього списку через пропуск.

a = list(map(int, input().split()))
print(max(a), min(a), sum(a))

#Вводиться число нових передплатників каналу щодня в один рядок через пропуск. На основі введеного рядка необхідно сформувати список lst із цілих чисел. Потрібно відсортувати елементи цього списку за спаданням і результат вивести на екран командою: print(*lst)

lst = sorted(list(map(int, input().split())), reverse=True)
print(*lst)

#Вводятся названия городов в одну строку через пробел. На основі цього рядка необхідно створити список lst і додати його в кінці наступного списку:
#cities = ["Москва", "Тверь", "Вологда"]
#Вивести результат на екран команди: print(*lst)

a = list(map(str, input().split()))
cities = ["Москва", "Тверь", "Вологда"]
lst = cities + a
print(*lst)

#Вводятся названия городов в одну строку через пробел. На основі цього рядка необхідно створити список lst і додати його в початок другого списку:
#cities = ["Москва", "Тверь", "Вологда"]
#Вивести результат на екран команди: print(*lst)

a = list(map(str, input().split()))
cities = ["Москва", "Тверь", "Вологда"]
lst = a + cities
print(*lst)