#Тернарний умовний оператор
a = 667
b = 832312
c = 312

res = a if a > b else b
print(res)

d = (a if a > c else c) if a > b else (b if b > c else c)
print(d)

#Задачі
#Вводиться два речові числа, кожне з нового рядка. Необхідно за допомогою тернарного умовного оператора найбільше значення присвоїти змінній d і вивести її на екран.

a = float(input())
b = float(input())
print(a if a > b else b)

#Вводиться ціле число. Необхідно змінній msg присвоїти рядок "кратно 3", якщо введене число кратно 3, а інакше присвоїти рядок "не кратно 3". Реалізувати програму за допомогою тернарного оператора. Змінити msg на екрані.

print("кратно 3" if int(input()) % 3 == 0 else "не кратно 3")

#Вводиться слово. Змінною msg присвоїти рядок "паліндром", якщо введене слово є паліндромом (однаково читається і вперед і назад), а інакше присвоїти рядок "не паліндром". Перевірку проводити без урахування регістру. Програму реалізувати за допомогою умовного тернарного оператора. Значення змінної msg відобразити на екрані.

s = str(input().lower())
print("палиндром" if s == s[::-1] else "не палиндром")

# Вводиться ціле число 0 або 1. Необхідно перетворити їх у рядки: 0 - "False", 1 - "True". Реалізувати це за допомогою умовного тернарного оператора. Результат відображається на екрані.

print("True" if int(input()) == 1 else "False")

#Вводиться поточний час (секунди) у діапазоні [0; 59]. Якщо значення рівне 59, то наступне має бути 0. І так по колу. Необхідно визначити наступне значення з перевіркою граничного значення 59. Реалізуйте це за допомогою тернарного умовного оператора. Результат відображається на екрані.
#PS Спробуйте також реалізувати це завдання з використанням лише арифметичних операцій.

inp = int(input())
print(inp + 1 if -1 < inp < 59 else 0)

#Є список базових нот:
#m = ['до', 'ре', 'ми', 'фа', 'соль', 'ля', 'си']
#Вводяться три цілих числа в діапазоні від 1 до 7 - номери нот, в один рядок через пропуск. Необхідно відобразити вказані ноти у вигляді рядка через пробіл, але перед нотами до та фа додатково ставити символ дієза '#'. Реалізувати цю програму за допомогою тернарного умовного оператора (він може використовуватися кілька разів).

m = ['#', 'до', 'ре', 'ми', 'фа', 'соль', 'ля', 'си']
print(*list(m[0] + m[i] if i in (1, 4) else m[i] for i in map(int, input().split())))