#Умовний оператор if. Конструкція if-else

x = -4
if x < 0:
    x = -x

print(x)

marks = [3, 3, 3, 4, 5, 12, 4]
if 1 and 2 in marks:
    print ("v les")
else:
    print("ne v les")
    
#Задачі
#Вводяться два речові числа в один рядок через пропуск. Вивести на екран найбільше чисел. Завдання вирішити з допомогою умовного оператора.

a, b = input().split()
if float(a) >= float(b):
    print(a)
else:
    print(b)
    
#Вводиться слово. Необхідно визначити, чи це слово є паліндромом (однаково читається вперед і назад, наприклад, АННА). Реєстр букв не враховувати. Якщо введене слово паліндром, на екран вивести ТАК, інакше - НІ.
    
s = str(input().lower())
if s == s[::-1]:
    print("ДА")
else:
    print("НЕТ")

#Вводяться два цілі позитивні числа m і n в один рядок через пробіл. Якщо число m ділиться націло на число n, вивести на екран приватне від поділу (результат поділу) як цілого числа. В іншому випадку вивести повідомлення "m на n націло не ділиться" (без лапок) і замість m і n підставити відповідні числа, наприклад: "13 на 2 націло не ділиться".
    
m, n = map(int, (input().split()))
if m % n == 0:
    print(int(m / n))
else:
    print(f"{m} на {n} нацело не делится")

#Вводяться три цілі позитивні числа в один рядок через пробіл. Переконатися, що два числа - це катети прямокутного трикутника, а третє - його гіпотенуза. (Підказка: перевірка робиться за теоремою Піфагора ). Якщо перевірка проходить (істинна), вивести на екран ТАК, інакше - НІ.
   
a, b, c = map(int, input().split())
if a * a + b * b == c * c:
    print("ДА")
else:
    print("НЕТ")

#Вводиться чотиризначне число. Перевірити, що воно закінчується на цифру 7. Вивести на екран ТАК, якщо це так і НІ - інакше.

s = str(input())
if s[-1] == "7":
    print("ДА")
else:
    print("НЕТ")

#Вводиться слово. Перевірити, що в цьому слові є всі три літери: t, h і o (у довільному порядку). Реалізувати програму за допомогою одного оператора. Якщо перевірка проходить, вивести ТАК, інакше – НІ.

s = str(input())
if s.count("t") > 0 and s.count("h") > 0 and s.count("o") > 0:
    print("ДА")
else:
    print("НЕТ")

#Вводиться список міст в один рядок через пропуск. Якщо в цьому списку є місто Москва, то видалити його. Вивести на екран результуючий список у вигляді рядка з містами через пропуск.

lst = list(map(str, input().split()))
if lst.count("Москва") > 0:
    lst.remove("Москва")
    print(*lst)
else:
    print(*lst)

#Вводяться чотири цілих числа a, b, c, d в один рядок через пропуск. Визначити, чи увійде до конверта з внутрішніми розмірами a і b мм прямокутна листівка з розмірами с і d мм. Для розміщення листівки у конверті необхідний зазор 1 мм з кожного боку. Листівку можна повертати на 90 градусів. Вивести ТАК, якщо входить і НІ – якщо не входить.

a, b, c, d = map(int, input().split())
if (a >= c + 2 and b >= d + 2) or (b >= c + 2 and a >= d + 2):
    print("ДА")
else:
    print("НЕТ")

#Вводиться шестизначне число. Визначити, чи воно є щасливим. (Щасливим називають таке шестизначне число, в якому сума перших трьох цифр дорівнює сумі його останніх трьох цифр.). Вивести ТАК, якщо щасливе і НІ - інакше.

lst = list(map(int, input().strip()))
if sum(lst[: 3]) == sum(lst[3: ]):
    print("ДА")
else:
    print("НЕТ")

#Робота світлофора для пішоходів запрограмована наступним чином: на початку кожної години протягом трьох хвилин горить зелений сигнал, потім протягом двох хвилин – червоний, протягом трьох хвилин – знову зелений тощо. у хвилинах, що минуло з початку чергової години. Визначити сигнал якого кольору горить для пішоходів у цей момент. На екран вивести повідомлення (без лапок) "green" - для зеленого та "red" - для червоного.

t = float(input())
if 0 <= t % 5 <= 3 % 5:
    print("green")
else:
    print("red")